# PanelScheduleSheetInstance Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleSheetInstance Class
Members See Also
---
The class represents an instance of a panel schedule placed on sheet.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class PanelScheduleSheetInstance : Element
```

Visual Basic
---
```text
Public Class PanelScheduleSheetInstance _
	Inherits Element
```

Visual C++
---
```text
public ref class PanelScheduleSheetInstance : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Electrical..::..PanelScheduleSheetInstance
# See Also
PanelScheduleSheetInstance Members
Autodesk.Revit.DB.Electrical Namespace